{
  "format": "layers-model",
  "generatedBy": "numpy-ultra-fast",
  "convertedBy": "custom",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              784
            ],
            "dtype": "float32"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "units": 1200,
            "activation": "relu",
            "use_bias": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "units": 10,
            "activation": "softmax",
            "use_bias": true
          }
        }
      ]
    },
    "keras_version": "2.12.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "dense_1/kernel",
          "shape": [
            784,
            1200
          ],
          "dtype": "float32",
          "byteOffset": 0,
          "byteLength": 3763200
        },
        {
          "name": "dense_1/bias",
          "shape": [
            1200
          ],
          "dtype": "float32",
          "byteOffset": 3763200,
          "byteLength": 4800
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            1200,
            10
          ],
          "dtype": "float32",
          "byteOffset": 3768000,
          "byteLength": 48000
        },
        {
          "name": "dense_2/bias",
          "shape": [
            10
          ],
          "dtype": "float32",
          "byteOffset": 3816000,
          "byteLength": 40
        }
      ]
    }
  ]
}